import feedback from '../../../public/feedback.jpg'
import educationIcon from '../../../public/graph-up.svg'
import thumbsUpIcon from '../../../public/hand-thumbs-up-fill.svg'
import heartIcon from '../../../public/heart-fill.svg'
import bookIcon from '../../../public/journal-bookmark-fill.svg'
import userIcon from '../../../public/people-fill.svg'
import { default as peopleIcon } from '../../../public/people.svg'
import playIcon from '../../../public/play-circle.svg'

export const navigationLinks = [
	{
		text: 'Присоединиться ',
		path: '/join',
	},
	{
		text: 'Наша команда',
		path: '/mentors',
	},
	{
		text: 'Советы',
		path: '/advices',
	},
	{
		text: 'Контакты',
		path: '/contact',
	},
	{
		text: 'Результаты',
		path: '/results',
	},
]

export const footerItems = [
	{
		title: 'Company',
		links: [
			{ text: 'About', href: '#' },
			{ text: 'Careers', href: '#' },
			{ text: 'Brand Center', href: '#' },
			{ text: 'Blog', href: '#' },
		],
	},
	{
		title: 'Help Center',
		links: [
			{ text: 'Discord Server', href: '#' },
			{ text: 'Twitter', href: '#' },
			{ text: 'Facebook', href: '#' },
			{ text: 'Contact Us', href: '#' },
		],
	},
	{
		title: 'Legal',
		links: [
			{ text: 'Privacy Policy', href: '#' },
			{ text: 'Licensing', href: '#' },
			{ text: 'Terms', href: '#' },
		],
	},
	{
		title: 'Download',
		links: [
			{ text: 'iOS', href: '#' },
			{ text: 'Android', href: '#' },
			{ text: 'Windows', href: '#' },
			{ text: 'MacOS', href: '#' },
		],
	},
]
export const ctaItems = [
	{
		id: '1',
		icon: bookIcon,
		title: 'Знания',
		desc: 'Поэтому мы не заставляем вас стать трейдером одного типа.',
	},
	{
		id: '2',

		icon: peopleIcon,
		title: 'Коннект',
		desc: 'Поэтому мы не заставляем вас стать трейдером одного типа.',
	},
	{
		id: '3',
		icon: educationIcon,
		title: 'Развитие',
		desc: 'Поэтому мы не заставляем вас стать трейдером одного типа.',
	},
]

export const benefitsItems = [
	{
		id: '1',
		icon: userIcon,
		desc: 'Поэтому мы не заставляем вас стать трейдером',
	},

	{
		id: '2',
		icon: heartIcon,
		desc: 'Поэтому мы не заставляем вас стать трейдером',
	},

	{
		id: '3',
		icon: playIcon,
		desc: 'Поэтому мы не заставляем вас стать трейдером',
	},
	{
		id: '4',
		icon: thumbsUpIcon,
		desc: 'Поэтому мы не заставляем вас стать трейдером',
	},
]

export const feedbackItems = [
	{
		id: '1',
		icon: feedback,
		title: 'Никита Журавлев',
		desc: '"Прошел обучение в школе по трейдингу и получил ценные знания о финансовых рынках. Преподаватели компетентны, материал интересен и доступен для понимания. Хорошее сочетание теории и практики. Рекомендую для тех, кто хочет освоить навыки трейдинга."',
	},
	{
		id: '2',
		icon: feedback,
		title: 'Никита Журавлев',
		desc: '"Прошел обучение в школе по трейдингу и получил ценные знания о финансовых рынках. Преподаватели компетентны, материал интересен и доступен для понимания. Хорошее сочетание теории и практики. Рекомендую для тех, кто хочет освоить навыки трейдинга."',
	},
	{
		id: '3',
		icon: feedback,
		title: 'Никита Журавлев',
		desc: '"Прошел обучение в школе по трейдингу и получил ценные знания о финансовых рынках. Преподаватели компетентны, материал интересен и доступен для понимания. Хорошее сочетание теории и практики. Рекомендую для тех, кто хочет освоить навыки трейдинга."',
	},
	{
		id: '4',
		icon: feedback,
		title: 'Никита Журавлев',
		desc: '"Прошел обучение в школе по трейдингу и получил ценные знания о финансовых рынках. Преподаватели компетентны, материал интересен и доступен для понимания. Хорошее сочетание теории и практики. Рекомендую для тех, кто хочет освоить навыки трейдинга."',
	},
	{
		id: '5',
		icon: feedback,
		title: 'Никита Журавлев',
		desc: '"Прошел обучение в школе по трейдингу и получил ценные знания о финансовых рынках. Преподаватели компетентны, материал интересен и доступен для понимания. Хорошее сочетание теории и практики. Рекомендую для тех, кто хочет освоить навыки трейдинга."',
	},
	{
		id: '6',
		icon: feedback,
		title: 'Никита Журавлев',
		desc: '"Прошел обучение в школе по трейдингу и получил ценные знания о финансовых рынках. Преподаватели компетентны, материал интересен и доступен для понимания. Хорошее сочетание теории и практики. Рекомендую для тех, кто хочет освоить навыки трейдинга."',
	},
]
export const advicesItems = [
	{
		id: '1',
		title: 'Практикуйтесь на Демо-счете',
		desc: 'Прежде чем вложить реальные деньги, попрактикуйтесь на демо-счете. Это позволит вам освоить платформу и проверить свои стратегии без финансовых рисков.',
	},
	{
		id: '2',
		title: 'Практикуйтесь на Демо-счете',
		desc: 'Прежде чем вложить реальные деньги, попрактикуйтесь на демо-счете. Это позволит вам освоить платформу и проверить свои стратегии без финансовых рисков.',
	},
	{
		id: '3',
		title: 'Практикуйтесь на Демо-счете',
		desc: 'Прежде чем вложить реальные деньги, попрактикуйтесь на демо-счете. Это позволит вам освоить платформу и проверить свои стратегии без финансовых рисков.',
	},
	{
		id: '4',
		title: 'Практикуйтесь на Демо-счете',
		desc: 'Прежде чем вложить реальные деньги, попрактикуйтесь на демо-счете. Это позволит вам освоить платформу и проверить свои стратегии без финансовых рисков.',
	},
]
